app/controllers/api/v1/events_controller.rb

    def index
        @events = Event.all
---
SELECT "user_events".* FROM "user_events" WHERE "user_events"."event_id" = $1  [["event_id", 1]]

    def create
        event = Event.new(event_params)
        if event.save
---
INSERT INTO "events" ("user_id", "title", "location", "description", "key_code", "active", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

        def find_event
            @event = Event.find(params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]