app/controllers/api/v1/song_entries_controller.rb

    def index
        @song_entries = SongEntry.all
---
SELECT "song_entries".* FROM "song_entries"