app/controllers/api/v1/user_events_controller.rb

SELECT "user_events".* FROM "user_events" WHERE "user_events"."event_id" = $1  [["event_id", 1]]
---
    def index
        @user_events = UserEvent.all

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
        def find_user_event
            @user_events = UserEvent.find(params[:id])